Охотники_и_рыболовы/src/Reports/ПродажаПутевок/ПродажаПутевок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПродажаПутевок</name>
  <attributes>
    <name>СводныйОтчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяОрганизация</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ОтчетныеВидыДичи</types>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДичи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетПоВидам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

Охотники_и_рыболовы/src/Reports/ПродажаПутевок/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если НЕ ЭтотОбъект.ОтчетПоВидам Тогда
		Если ЭтотОбъект.ФорматДичи и ЭтотОбъект.СводныйОтчет Тогда
			ИмяГруппировки = "ТО";
		ИначеЕсли  НЕ ЭтотОбъект.ФорматДичи и ЭтотОбъект.СводныйОтчет Тогда
			ИмяГруппировки = "ДО";
		ИначеЕсли НЕ ЭтотОбъект.СводныйОтчет	и ЭтотОбъект.ФорматДичи Тогда
			 ИмяГруппировки = "ТП";
		Иначе
			 ИмяГруппировки = "ДП";
		КонецЕсли;	
	Иначе ИмяГруппировки = "ОПВ";
	КонецЕсли;
	
	Для Каждого ГруппировкаСКД Из КомпоновщикНастроек.Настройки.Структура Цикл
			ГруппировкаСКД.Использование = ?(ГруппировкаСКД.Имя = ИмяГруппировки, Истина, Ложь);
	КонецЦикла;
	
	Охотхозяйство = ЭтотОбъект.ОсновнаяОрганизация;
	Если НЕ Охотхозяйство.Пустая() Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОхотхозяйствоПользователя",Охотхозяйство);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОхотхозяйствоПользователя")).Использование =Ложь;
	КонецЕсли;	
	
	МестоОхоты = ЭтотОбъект.МестоОхоты;
	Если НЕ МестоОхоты.Пустая() Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("МестоОхоты",МестоОхоты);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МестоОхоты")).Использование =Ложь;
	КонецЕсли;	
	
	
	ВидДичи = ЭтотОбъект.ВидДичи;
	Если НЕ ВидДичи.Пустая() Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидДичи",ВидДичи);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидДичи")).Использование =Ложь;
	КонецЕсли;	
	

	      
	ПериодОтчета = ЭтотОбъект.ПериодОтчета;
	Если ЗначениеЗаполнено(ПериодОтчета) Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета",ПериодОтчета);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета")).Использование =Ложь;
	КонецЕсли;	
	
	ОхотаСервер.ЗаполнитьЗаголовокОтчета(ЭтотОбъект);
	
КонецПроцедуры
